app/Controllers/Login_controller.php

SELECT *
FROM `usuario`
WHERE `usuario` = 'dai'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $usuarioModel = new Usuario();
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $datos = $usuarioModel->where('usuario', $usuario)->first();