app/Controllers/Usuario_controller.php

SELECT *
FROM `usuario`
---
    public function index()
    {
        $usuarioModel = new Usuario();
        $datos ['usuarios'] = $usuarioModel->findAll();

INSERT INTO `usuario` (`nombre_completo`, `usuario`, `correo`, `telefono`, `direccion`, `password`) VALUES ('Dahiana Bisss', 'dai', 'dai@correo.com', '3794409720', 'Castro ', '$2y$10$jNGhh6kvZjxwm9DegNCSq.I86LRqeIh/SCWuhk/DN2//jq62Y6EZ6')
---
    public function cargarUsuario()
    {
        $usuarioModel = new Usuario();

        $validationRules = $usuarioModel->validationRules;
        $validationRules['usuario'] = 'required|min_length[3]|max_length[10]|is_unique[usuario.usuario]';

        if (!$this->validate($validationRules, $usuarioModel->validationMessages)) {
            $errores = $this->validator->getErrors();
            return redirect()->to('/registro')->withInput()->with('errores', $errores);
        }

        $datos = [
            'nombre_completo' => $this->request->getPost('nombre_completo'),
            'usuario' => $this->request->getPost('usuario'),
            'correo' => $this->request->getPost('correo'),
            'telefono' => $this->request->getPost('telefono'),
            'direccion' => $this->request->getPost('direccion'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
        ];

        $usuarioModel->insert($datos);